controllers/ErrorController.php

	function actionIndex(){
		$errorcode = Errorcode::find()->all();
---
SELECT * FROM "b_errorcode"

	function actionForm($i_errorcode_id=null){

		$errorcode = new Errorcode();

		if(!empty($i_errorcode_id)){
			$errorcode = Errorcode::findone($errorcode);
		}



		$typeall = Type::find()->orderBy('n_errorcode_type asc')->all();
		$type = ArrayHelper::map($typeall,'i_errorcode_type_id','n_errorcode_type');

		if(!empty($_POST))
		{
			$errorcode->n_errorcode = $_POST['Errorcode']['n_errorcode'];
			$errorcode->c_rank = $_POST['Errorcode']['c_rank'];
			$errorcode->c_code = $_POST['Errorcode']['c_code'];
			$errorcode->i_errorcode_type_id = $_POST['Errorcode']['i_errorcode_type_id'];

			if($errorcode->save())
---
SELECT * FROM "b_errorcode_type" ORDER BY "n_errorcode_type"
INSERT INTO "b_errorcode" ("n_errorcode", "c_rank", "c_code", "i_errorcode_type_id") VALUES ('test2', 'B', '555', 1) RETURNING "i_errorcode_id"